text = {'Menu': '👋 Це головне меню. Ти можеш обрати один з пунктів меню і перейти до додавання локацій 🙂',
        'AQ Menu': 'Тут ти можеш дивитись 📱 інформацію про якість повівтря та додавати локації для відслідковування',
        'AT Menu': 'Тут ти можеш дивитись 📱 інформацію про температуру🌡 та додавати локації для відслідковування',
        'Instructions': 'Цей бот показує актуальну інформацію про температуру та стан якості повітря.\n\nЩоб перейти до'
                        ' відслідковування температури треба в головному меню перейти до Температура Повітря🌡. Щоб перейти до '
                        'відслідковування якості повітря - перейди до пункту меню Якість Повітря📊.\n\n Щоб додати нову локацію '
                        'треба перейти до меню Додати Локацію та обрати потрібний пункт. Щоб переглянути свої локації - натисни '
                        'Мої Локації📍.\n\nЩоб отримати повну інструкцію - натисніть кнопку <b><i>Інструкція</i></b>.',
        'Ok': 'Oк', 'Change': 'Змінити',
        'Air Quality': 'Якість Повітря📊',
        'Air Temperature': 'Температура Повітря🌡',
        'Back': 'Назад',
        'Add Location': 'Додати Локацію🌐',
        'My Locations': 'Мої Локації📍',
        'About This Bot': 'Інструкція',
        'Select From List': 'Обрати зі списку📄',
        'Geolocation': 'Геолокація📍',
        'AQ Select city': 'Оберіть місто🏙',
        'AQ Add Location Menu': 'Натисніть обрати зі списку якщо ви хочете обрати місто серед міст '
                                'України, або натисніть Геолокація щоб обрати місце за вашими координатами',
        'AQ Ask to add location': 'Чи хочете ви зберегти дану локацію до свого списку?',
        'Yes': 'Так', 'No': 'Ні',
        'AQ Enter name for location': 'Локація буде збережена під ім\'ям <b><i>{}</i></b>. '
                                      'Якщо ви згодні натисніть <b>ОК</b>, інакше - <b>Змінити</b>',
        'AQ Length limit of name': 'Максимальна довжина назви 20 букв',
        'AQ Save new location name': 'Зберегти ім\'я?',
        'Save': 'Зберегти',
        'AQ Location name will be': 'Встановлене ім\'я для локації - <b><i>{}</i></b>',
        'AQ Turn On/Off notifications': 'Чи бажаєте ви отримувати сповіщення про зміну стану повітря в даній локації?',
        'AQ Write new name': 'Будь ласка, напишіть нове ім\'я',
        'AQ You have this location': 'У вас вже є ця локація. Вона збережена під ім\'ям <b><i>{}</i></b>',
        'AQ Share your location': 'Надішліть свою локацію', 'AQ My location': 'Моя геолокація',
        'AQ If have got your location and searching for result': 'Я отримав вашу геолокацію та починаю пошук даних',
        'AQ Location with such name already exists': 'Локація з таким іменем вже існує. Будь ласка, напишіть інше ім\'я',
        'AQ You have no locations': 'На даний момент у вас немає жодної збереженої локації',
        'AQ Show user locations': 'Ось список ваших локацій. Оберіть якусь одну щоб подивитися поточний стан та відкрити налаштування⚙️',
        'AQ You have no location with this name. Select from keyboard': 'У вас немає локації з таким іменем, оберіть локацію з клавіатури',
        'AQ User Location Info': 'Локація {}: Рівень повітря aqi {}📈.\n\nКрок {}.'
                                 '\nСповіщення {}.',
        'AQ Edit Name': 'Редагувати Ім\'я', 'AQ Edit Step': 'Редагувати Крок',
        'AQ Notifications Off': 'Вимкнути сповіщення',
        'AQ Notifications On': 'Ввімкнути сповіщення',
        'AQ Delete location': 'Видалити',
        'AQ Update Error': 'Помилка оновлення!',
        'AQ Notifications turned off': 'Сповіщення вимкнені',
        'AQ Notifications turned on': 'Сповіщення ввімкнені',
        'Update': 'Оновити',
        'AQ Edit name of location': 'Напишіть нове ім\'я та натисніть Зберегти',
        'AQ Name did not change': 'Ім\'я не змінилося',
        'AQ Please send new name': 'Будь ласка, напишіть нове ім\'я!',

        'AQ Edit step of location': 'Напишіть новий крок та натисніть Зберегти',
        'AQ Length limit of step': 'Максимально можливе значення Кроку - 99',
        'AQ Please send new step': 'Бкдь ласка, введіть нове значення',
        'AQ Location step will be': 'Встановлений крок для локації - <b><i>{}</i></b>',
        'AQ Step did not change': 'Крок не змінився',
        'AQ Step must be > 0': 'Крок має бути більшим за 0!',
        'AQ Save new location step': 'Зберегти крок?',
        'AQ Send digit': 'Треба написати число!',

        'AT Add Location Menu': 'Натисніть Геолокація щоб обрати місце за вашими координатами',
        'AT Share your location': 'Надішліть свою геолокацію',
        'AT My location': 'Моя геолокація',
        'AT If have got your location and searching for result': 'Я отримав вашу геолокацію та починаю пошук даних',
        'AT Temperature for city': 'Температура на наступні 3 дні у місті <b>{}</b>:\n',  # !переписати
        'AT Temperature for time': 'Станом на {}:  {}°C {}\n',  # !переписати
        'Clouds': '☁️',
        'Rain': '🌧',
        'Clear': '☀️',
        'AT There are no information': 'Немає інформації',
        'AT Ask to add location': 'Чи хочете ви додати локацію до своїх збережених?',
        'AT Name exists, change it': 'Локація з іменем <b><i>{}</i></b> вже є, напишіть нове ім\'я і натисніть Зберегти',
        'AT Length limit of name': 'Максимальна довжина імені 20 букв',
        'AT Location with such name already exists': 'Локація з таким іменем вже є. Напишіть нове ім\'я',
        'AT Save new location name': 'Зберегти ім\'я?',
        'AT Location name will be': 'Встановлене ім\'я для локації - <b><i>{}</i></b>',
        'AT Turn On/Off notifications': 'Чи бажаєш ти отримувати сповіщення про погоду?',
        'AT Do you want to change name': 'Чи хочете ви змінити ім\'я {} локації?',
        'AT Ok, write new name for this location': 'Ок. Напиши нове ім\'я для локації',
        'AT Ok, name will be': 'Добре, ім\'я буде <b>{}</b>',
        'AT Do you want to set notifications': 'Чи хочеш ти ввімкнути сповіщення? Вони будуть приходити раз на день',
        'AT Please send new name': 'Напишіть нове ім\'я!',
        'AT Show user locations': 'Ось список ваших локацій. Оберіть одну та побачите поточну погоду. Також відкриються налаштування',
        'AT You have no location with this name. Select from keyboard': 'У вас немає локації з таким іменем, обирайте з клавіатури',
        'AT Settings': 'Ти можеш змінити ім\'я локації, ввімкнути/вимкнути сповіщення або видалити її',
        'AT Edit Name': 'Редагувати Ім\'я',
        'AT Notifications Off': 'Вимкнути сповіщення',
        'AT Notifications On': 'Ввімкнути сповіщення',
        'AT Delete location': 'Видалити',
        'AT Notifications turned off': 'Сповіщення вимкнені',
        'AT Notifications turned on': 'Сповіщення ввімкнені',
        'AT Edit name of location': 'Напишіть нове ім\'я та натисніть Зберегти.',
        'AT Name did not change': 'Ім\'я не змінилося',
        'AT You have no locations': 'У вас немає локацій',

        'help command': "🔘 Щоб перейти до налаштувань <i><b>Якості повітря</b></i> - натисни на кнопку з такою назвою."
                        "Якщо ж ти хочеш подивитись погоду - натисни <i><b>Температура повітря</b></i>."
                        "🔘 Незалежно до того куди ви перейшли, щоб додати нову локацію треба натиснути <i><b>Додати локацію</b></i>. Там "
                        ", якщо ви у меню <b>Якості повітря</b>, буде дві кнопки - <i><b>Геолокація</b></i> and <i><b>Обрати зі списку"
                        "</b></i>. Якщо ти хочеш щоб бот сам знайшов найюлижчу станцію до тебе - натисни першу,"
                        "інакше обирай другу кнопку.\nЯкщо ти вибереш <i><b>Обрати зі списку</b></i>, там "
                        "ти побачиш список країн - обирай потрібну. Потім обирай місто.\nПісля того як ви"
                        " обрали потрібне місто чи відправили своє місцезнаходження, бот запитає вас"
                        " чи не хочете ви зберегти цю локацію. Відповідайте як захочете.\nЯкщо ви відповіли Так, "
                        "бот попросить обрати назву для нової локації. Ви можете відправити(треба обов'язково відправити"
                        " назву, не тільки набрати) і натиснути <i><b>Додати</b></i>. Потім оберіть чи хочете ви"
                        "отримувати повідомлення про зміну стану рівня повітря.\n\n🔘 Якщо ви натиснете <i><b>Мої "
                        "локації</b></i>, то побачите список всіх локацій що ви зберігли або бот повідомить що їх "
                        "немає. Якщо у вас є хоча б одна локація, ви можете натиснути на неї та отримати поточну "
                        "інформацію. Подивіться на клавіатуру, там ви побачите Налаштування цієї локації."
                        " Ви можете змінити:\n   Назву: натисни на <i><b>Редагувати Ім'я</b></i>✍️ та надішслати"
                        "(обов'язково відправити, не тільки набрати) нову назву боту, потім натисніть <i><b>Змінити</b>"
                        "</i>.\n   Крок: спочатку, ви повинні знати що Рівень Якості Повітря вимірюється в змінних "
                        "AQI - це число яке ви будете бачити в Інформаційних Повідомлення від бота. Крок - це число"
                        " на яке повинне змінитися AQI щоб ви отримали повідомлення. Щоб його змінити - натисніть "
                        "<i><b>Редагувати Крок</b></i>✍️, оберіть новий Крок на клавіатурі і тільки потім натисніть <i><b>"
                        "Змінити</b></i>.\n   Повідомлення: щоб ВИКЛ/ВКЛ повідомлення натисніть <i><b>Повідомлення Викл"
                        "</b></i>🔕/<i><b>Повідомлення Вкл</b></i>🔔.\n   Щоб видалити локацію - натисніть <i><b>Видалити "
                        "Локацію</b></i>🗑. У меню <b>Температури повітря</b> все буде так само, але додати локацію ви можете "
                        "тільки через <i><b>Геолокацію</b></i>, а у меню <i><b>Налаштувань</b></i> не буде кроку.\n\n🔘 У "
                        "<i><b>Інструкція</b></i> ви отримаєте інструкцію.",

        "About bot": "Привіт! Мене звати Влад.\n\nЯ зробив цього бота як дипломну роботу, яку після"
                     "завершення, я запустив на сервері для постійної роботи. Він написаний на мові "
                     "програмування Python та використовую API(Application Program Interface) для "
                     "отримання інформації про стан повітря та температуру. Ви "
                     "можете подивитись інструкцію по його використанню натиснувши <b><i>Інструкція</i></b> в головному меню.\n\n"
                     "Дякую за використання цього бота.",

        "AQ AQI increased": "🔴Рівень якості повітря на локації {} погіршився!🔴\n\n",
        "AQ AQI decreased": "🟢Рівень якості повітря на локації {} покращився!🟢\n\n",

        "Lviv": "Львів", "Львів": "Lviv",
        "Simferopol": "Сімферополь", "Сімферополь": "Simferopol",
        "Luhansk": "Луганськ", "Луганськ": "Luhansk",
        "Donetsk": "Донецьк", "Донецьк": "Donetsk",
        "Chernihiv": "Чернігів", "Чернігів": "Chernihiv",
        "Kherson": "Херсон", "Херсон": "Kherson",
        "Mykolaiv": "Миколаїв", "Миколаїв": "Mykolaiv",
        "Ivano-Frankivsk": "Івано-Франківськ", "Івано-Франківськ": "Ivano-Frankivsk",
        "Kyiv": "Київ", "Київ": "Kyiv",
        "Ternopil": "Тернопіль", "Тернопіль": "Ternopil",
        "Rivne": "Рівне", "Рівне": "Rivne",
        "Lutsk": "Луцьк", "Луцьк": "Lutsk",
        "Odessa": "Одеса", "Одеса": "Odessa",
        "Zaporizhzhya": "Запоріжжя", "Запоріжжя": "Zaporizhzhya",
        "Sumy": "Суми", "Суми": "Sumy",
        "Dnipro": "Дніпро", "Дніпро": "Dnipro",
        "Kropyvnytskyi": "Кропивницький", "Кропивницький": "Kropyvnytskyi",
        "Vinnytsia": "Вінниця", "Вінниця": "Vinnytsia",
        "Kharkiv": "Харків", "Харків": "Kharkiv",
        "Khmelnytsky": "Хмельницький", "Хмельницький": "Khmelnytsky",
        "Chernivtsi": "Чернівці", "Чернівці": "Chernivtsi",
        "Zhytomyr": "Житомир", "Житомир": "Zhytomyr",
        "Cherkasy": "Черкаси", "Черкаси": "Cherkasy",
        "Poltava": "Полтава", "Полтава": "Poltava",
        "Uzhhorod": "Ужгород", "Ужгород": "Uzhhorod"}


def aq_aqi_answer(response):
    response_text = ""

    if response["status"] == "ok":
        aqi = response["data"]["aqi"]

        if aqi <= 50:
            response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                     "🟢 <b>Добре</b> 🟢\n" \
                                                     "Якість повітря вважається задовільною, а забруднення повітря становить невеликий ризик або взагалі його не становить."
        elif 51 <= aqi <= 100:
            response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                     "🟡 <b>Помірний</b> 🟢\n" \
                                                     "Якість повітря є прийнятною. Однак деякі забруднюючі речовини можуть " \
                                                     "турбувати здоров’я дуже невеликої кількості людей, які надзвичайно чутливі до забруднення " \
                                                     "повітря.\n\n" \
                                                     "Активні діти та дорослі, а також люди з респіраторними захворюваннями, такими як астма, повинні обмежувати тривалі навантаження на вулиці."
        elif 101 <= aqi <= 150:
            response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                     "🟡 <b>Шкідливий для чутливих груп</b> 🟡\n" \
                                                     "Члени чутливих груп можуть відчувати наслідки для здоров'я. " \
                                                     "Населення, швидше за все, не постраждає.\n\n" \
                                                     "Активні діти та дорослі, а також люди з респіраторними захворюваннями, такими як астма, повинні обмежувати тривалі навантаження на вулиці."
        elif 151 <= aqi <= 200:
            response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                     "🟠 <b>Шкідливо</b> 🟠\n" \
                                                     "Кожна людина може почати відчувати наслідки для здоров’я. " \
                                                     "Члени чутливих груп можуть відчувати більш серйозні наслідки для здоров'я.\n\n" \
                                                     "Активні діти та дорослі, а також люди з респіраторними захворюваннями, " \
                                                     "таких як астма, слід уникати навантажень на відкритому повітрі. " \
                                                     "Всім іншим слід обмежити тривалі навантаження на вулиці."
        elif 201 <= aqi <= 300:
            response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                     "🟠 <b>Дуже шкідливо</b> 🔴\n" \
                                                     "Попередження про надзвичайні умови. Все населення, " \
                                                     "швидше за все, постраждає.\n\n" \
                                                     "Активні діти та дорослі, а також люди з респіраторними захворюваннями, такі як " \
                                                     "астми, слід уникати будь-яких навантажень на вулиці. Усі інші, особливо " \
                                                     "дітям, слід обмежити навантаження на вулиці."
        elif 301 <= aqi:
            response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                     "🔴 <b>Небезпечно</b> 🔴\n" \
                                                     "Попередження про стан здоров’я: кожен може відчувати більш серйозні наслідки для здоров’я.\n\n" \
                                                     "Кожен повинен уникати будь-яких навантажень на вулиці."

        return response_text, aqi
    else:
        return "Sorry", "NoData"



def aq_aqi_answer_by_number(aqi):
    response_text = ""

    if aqi <= 50:
        response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                 "🟢 <b>Добре</b> 🟢\n" \
                                                 "Якість повітря вважається задовільною, а забруднення повітря становить невеликий ризик або взагалі його не становить."
    elif 51 <= aqi <= 100:
        response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                 "🟡 <b>Помірний</b> 🟢\n" \
                                                 "Якість повітря є прийнятною. Однак деякі забруднюючі речовини можуть " \
                                                 "турбувати здоров’я дуже невеликої кількості людей, які надзвичайно чутливі до забруднення " \
                                                 "повітря.\n\n" \
                                                 "Активні діти та дорослі, а також люди з респіраторними захворюваннями, такими як астма, повинні обмежувати тривалі навантаження на вулиці."
    elif 101 <= aqi <= 150:
        response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                 "🟡 <b>Шкідливий для чутливих груп</b> 🟡\n" \
                                                 "Члени чутливих груп можуть відчувати наслідки для здоров'я. " \
                                                 "Населення, швидше за все, не постраждає.\n\n" \
                                                 "Активні діти та дорослі, а також люди з респіраторними захворюваннями, такими як астма, повинні обмежувати тривалі навантаження на вулиці."
    elif 151 <= aqi <= 200:
        response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                 "🟠 <b>Шкідливо</b> 🟠\n" \
                                                 "Кожна людина може почати відчувати наслідки для здоров’я. " \
                                                 "Члени чутливих груп можуть відчувати більш серйозні наслідки для здоров'я.\n\n" \
                                                 "Активні діти та дорослі, а також люди з респіраторними захворюваннями, " \
                                                 "таких як астма, слід уникати навантажень на відкритому повітрі. " \
                                                 "Всім іншим слід обмежити тривалі навантаження на вулиці."
    elif 201 <= aqi <= 300:
        response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                 "🟠 <b>Дуже шкідливо</b> 🔴\n" \
                                                 "Попередження про надзвичайні умови. Все населення, " \
                                                 "швидше за все, постраждає.\n\n" \
                                                 "Активні діти та дорослі, а також люди з респіраторними захворюваннями, такі як " \
                                                 "астми, слід уникати будь-яких навантажень на вулиці. Усі інші, особливо " \
                                                 "дітям, слід обмежити навантаження на вулиці."
    elif 301 <= aqi:
        response_text = "AQI = <b>" + str(aqi) + "</b>🌡\n\n" \
                                                 "🔴 <b>Небезпечно</b> 🔴\n" \
                                                 "Попередження про стан здоров’я: кожен може відчувати більш серйозні наслідки для здоров’я.\n\n" \
                                                 "Кожен повинен уникати будь-яких навантажень на вулиці."

    return response_text



def compose_a_message(answer):
    """composes answer"""
    answer = answer["data"]
    aqi = answer["aqi"]

# Instructions
# "🔘 Ти можеш добавити нову локацію натиснувши <i><b>Обрати нове місце</b></i>. Там "
#                          "буде дві кнопки - <i><b>Моє місцезнаходження</b></i> and <i><b>Обрати зі списку"
#                          "</b></i>. Якщо ти хочеш щоб бот сам знайшов найюлижчу станцію до тебе - натисни першу,"
#                          "інакше обирай другу кнопку. \nЯкщо ти вибереш <i><b>Обрати зі списку</b></i>, там "
#                          "ти побачиш список країн - обирай потрібну. Потім обирай місто.\nПісля того як ти"
#                          " обрав(-ла) потрібне місто чи відправив(-ла) своє місцезнаходження, бот запитає тебе"
#                          " чи не хочеш ти зберегти цю локацію. Відповідай як хочеш.\nЯкщо ти відповів(-ла) Так, "
#                          "бот попросить обрати назву для нової локації. Ти можеш відправити(треба обов'язково відправити"
#                          " назву, не тільки набрати) і натиснути <i><b>Додати</b></i>. Потім обери чи хочешь ти"
#                          "отримувати повідомлення про зміну стану рівня повітря.\n\n🔘 Якщо ти натиснеш <i><b>Мої "
#                          "локації</b></i>, ти побачиш список всіх локацій що ти зберіг(-ла) або бот повідомить що їх "
#                          "немає. Якщо в тебе є хоча б одна локація, ти можешь натиснути на неї та отримати поточну "
#                          "інформацію про неї. Подивись на клавіатуру, там ти побачиш Налаштування цієї локації."
#                          " Ти можеш змінити:\n   Назву: натисни на <i><b>Редагувати Ім'я</b></i>✍️ та надішли"
#                          "(обов'язково відправити, не тільки набрати) нову назву боту, потім натисни <i><b>Змінити</b>"
#                          "</i>.\n   Крок: спочатку, ти повинен(-нна) знати що Рівень Якості Повітря вимірюється в змінних "
#                          "AQI - це число яке ти будеш бачити в Інформаційних Повідомлення від бота. Крок - це число"
#                          " на яке повинне змінитися AQI щоб ти отримав(-ла) повідомлення. Щоб його змінити - натисни "
#                          "<i><b>Редагувати Крок</b></i>✍️, обери новий Крок на клавіатурі і тільки потім натисни <i><b>"
#                          "Змінити</b></i>.\n   Повідомлення: щоб ВИКЛ/ВКЛ повідомлення натисни <i><b>Повідомлення Викл"
#                          "</b></i>🔕/<i><b>Повідомлення Вкл</b></i>🔔.\n   Щоб видалити локацію - натисни <i><b>Видалити "
#                          "Локацію</b></i>🗑.\n\n🔘 У <i><b>Про бота</b></i> ти дізнаєшься відповідну інформацію."
#                          "\n\n🔘 У <i><b>Налаштування</b></i>⚙️ ти можешь змінити мову.\n\n\nЯкщо ти виявиш помилку, "
#                          "або маєш якісь пропозиції, то можеш написати мені @snegovskyvlad."
